---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutOfOrder
source: html/0bbd2076-5980-acff-0a17-eb4c0bcf203d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutOfOrder Property

Curtain wall grid lines have changed order.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridOutOfOrder { get; }
```